const validate = {
    required: ['必填项不能为空', /[\S]+/],
    phone: ['请输入正确的手机号', /^1\d{10}$/],
    email: ['邮箱格式不正确', /^([a-zA-Z0-9_\.\-])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+$/],
    url: ['链接格式不正确', /(^#)|(^http(s*):\/\/[^\s]+\.[^\s]+)/],
    number: ['只能填写数字', /^\d+$/],
    date: ['日期格式不正确', /^(\d{4})[-\/](\d{1}|0\d{1}|1[0-2])([-\/](\d{1}|0\d{1}|[1-2][0-9]|3[0-1]))*$/],
    identity: ['请输入正确的身份证号', /(^\d{15}$)|(^\d{17}(x|X|\d)$)/]
}

/**
 * 国际标准的银行卡号（储蓄卡和信用卡），注意：不包括各个银行的企业账户
 * @param str 
 */
export function isBackCard(str) {
    const reg = /^([45][0-9]{11,15}|62[0-9]{14,17})$/
    return reg.test(str)
};

/**
 * 中国的身份证号码
 */
export function isIdCard(str) {
    const reg = /^([1-9]\d{5}[12][0-9]{3}[01][0-9][0-3][0-9]\d{3}[0-9X])$/;

    return reg.test(str);
};

/**
 * 中国三大运营商的电话号码
 */
export function isPhoneNum(str) {
    const reg = /^((86)?(13[0-9]|15[0-3,5-9]|18[0-9]|19[89]|17[0135678]|166|14[579])\d{8})$/;

    return reg.test(str);
};